Model: "sequential_1"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
conv2d_1 (Conv2D)            (None, 150, 100, 32)      896       
_________________________________________________________________
conv2d_2 (Conv2D)            (None, 150, 100, 32)      9248      
_________________________________________________________________
max_pooling2d_1 (MaxPooling2 (None, 75, 50, 32)        0         
_________________________________________________________________
dropout_1 (Dropout)          (None, 75, 50, 32)        0         
_________________________________________________________________
conv2d_3 (Conv2D)            (None, 75, 50, 64)        18496     
_________________________________________________________________
conv2d_4 (Conv2D)            (None, 75, 50, 64)        36928     
_________________________________________________________________
max_pooling2d_2 (MaxPooling2 (None, 37, 25, 64)        0         
_________________________________________________________________
dropout_2 (Dropout)          (None, 37, 25, 64)        0         
_________________________________________________________________
flatten_1 (Flatten)          (None, 59200)             0         
_________________________________________________________________
dense_1 (Dense)              (None, 128)               7577728   
_________________________________________________________________
dropout_3 (Dropout)          (None, 128)               0         
_________________________________________________________________
dense_2 (Dense)              (None, 29)                3741      
=================================================================
Total params: 7,647,037
Trainable params: 7,647,037
Non-trainable params: 0
_________________________________________________________________




Train on 15249 samples, validate on 1695 samples
Epoch 1/4
   15249/15249 [==============================] - 597s 39ms/step - loss: 0.2138 - accuracy: 0.9245 - val_loss: 0.2035 - val_accuracy: 0.9249
Epoch 2/4
   15249/15249 [==============================] - 737s 48ms/step - loss: 0.2042 - accuracy: 0.9271 - val_loss: 0.2043 - val_accuracy: 0.9281
Epoch 3/4
   15249/15249 [==============================] - 577s 38ms/step - loss: 0.1999 - accuracy: 0.9289 - val_loss: 0.2029 - val_accuracy: 0.9294
Epoch 4/4
   15249/15249 [==============================] - 674s 44ms/step - loss: 0.1940 - accuracy: 0.9299 - val_loss: 0.2008 - val_accuracy: 0.9294
